rottenpotatoes/app/controllers/movies_controller.rb

  def director
      @display =  "Similar Movies page for #{Movie.find(params[:id]).title}"
      @movies = Movie.similar_Director(params[:id])
      if @movies == [] then
        flash[:notice] = "'#{Movie.find(params[:id]).title}' has no director info"
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 0]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "test"]]